Дошкольное_учреждение83/src/Catalogs/удуРодители/удуРодители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуРодители</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Национальность</name>
    <type>
      <types>CatalogRef.удуНациональности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиПаспорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдачиПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоциальныеУсловия</name>
    <type>
      <types>CatalogRef.удуСоциальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖилищныеУсловия</name>
    <type>
      <types>CatalogRef.удуЖилищныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальноеПоложение</name>
    <type>
      <types>CatalogRef.удуМатериальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуПол/удуПол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуПол</name>
  <enumValues>
    <name>Мальчик</name>
  </enumValues>
  <enumValues>
    <name>Девочка</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуДети/удуДети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуДети</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтатусРебенка</name>
    <type>
      <types>EnumRef.удуСтатусРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.удуПол</types>
    </type>
  </attributes>
  <attributes>
    <name>Национальность</name>
    <type>
      <types>CatalogRef.удуНациональности</types>
    </type>
  </attributes>
  <attributes>
    <name>РоднойЯзык</name>
    <type>
      <types>CatalogRef.удуЯзыкиНародовМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиСвидетельства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдачиСвидетельства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаРождения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоциальноеПоложение</name>
    <type>
      <types>CatalogRef.удуСоциальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖилищныеУсловия</name>
    <type>
      <types>CatalogRef.удуЖилищныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальноеПоложение</name>
    <type>
      <types>CatalogRef.удуМатериальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСоциальныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотографияРебенка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуРодители/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбораПоРаботнику = РеквизитСведенияОРаботе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоРаботнику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоРаботнику.Использование = Истина;
	ЭлементОтбораПоРаботнику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Работник");
	ЭлементОтбораПоРаботнику.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоРаботнику.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементОтбораПоУченику = РеквизитСведенияОбОбразовании.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУченику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУченику.Использование = Истина;
	ЭлементОтбораПоУченику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Обучающийся");
	ЭлементОтбораПоУченику.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУченику.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	ЭлементОтбораПоРодителю = РеквизитСоставСемьи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоРодителю.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоРодителю.Использование = Истина;
	ЭлементОтбораПоРодителю.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЧленСемьи");
	ЭлементОтбораПоРодителю.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоРодителю.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	РеквизитСоставСемьи.Параметры.УстановитьЗначениеПараметра("Мальчик", Перечисления.удуПол.Мальчик);
	
	ЭтаФорма.Элементы.ГруппаСведенияОМестеРаботы.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
	ЭтаФорма.Элементы.РеквизитСведенияОРаботе.Видимость = Булево(Объект.Работает = 1);
	ЭтаФорма.Элементы.РеквизитСведенияОбОбразовании.Видимость = Булево(Объект.Работает = 0);
	
	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Работает = 2;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОРаботе.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Работник" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОбОбразовании.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Обучающийся" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаЭлемент Из РеквизитСоставСемьи.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "ЧленСемьи" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Элементы.ГруппаСведенияОМестеРаботы.Доступность = ЗначениеЗаполнено(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитСоставСемьиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "Ребенок" Тогда		
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ребенок);
		ОткрытьФормуМодально("Справочник.удуДети.ФормаОбъекта", ПередаваемыеПараметры, ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолеРаботаетПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЭтаФорма.Элементы.РеквизитСведенияОРаботе.Видимость = Булево(Объект.Работает = 1);
	ЭтаФорма.Элементы.РеквизитСведенияОбОбразовании.Видимость = Булево(Объект.Работает = 0);	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененУдуРодитель", Объект.Ссылка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)	
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры
